ajohnson-smarthome/AJMiddleCar/firmware/s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# The USB device class. NCM rather than ECM or RNDIS because it is the one both
# macOS and iOS are expected to accept class-compliant, and the only mode IDF's
# tusb_ncm example is built around.
CONFIG_TINYUSB_NET_MODE_NCM=y

# Console on UART0, reached through the board's second Type-C and its bridge chip.
#
# This is forced, not preferred: on ESP32-S3 the native USB pins (GPIO19/20) are muxed
# between the USB-Serial-JTAG controller and the USB-OTG controller, and only one may
# have them. TinyUSB needs USB-OTG, so the moment NCM comes up the USB console would
# disappear mid-session. Putting the console on UART0 from the start means logs never
# move.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n

# 16 MB flash with a custom table: two 4 MB OTA slots, plus a reserved data partition.
# The slots predate the OTA code by two plans — see partitions.csv for why the table is the half
# that gets decided first.
#
# Rollback is on. An image written through POST /ota boots once as PENDING_VERIFY and is reverted
# by the bootloader unless it cancels that itself; main.c cancels it at the end of app_main, after
# the HTTP server that could deliver a replacement is answering. The property this protects is
# reachability — a dongle lives in a pocket, and an image that boots but cannot serve /ota is one
# that needs a cable and a laptop to undo.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# N16R8: 16 MB flash, 8 MB PSRAM on an octal bus. Octal PSRAM occupies GPIO33-37 —
# nothing here needs them, but note it before assigning pins.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# The S3 has its own radio — unlike the P4, which has none and drives a C6 over SDIO. Nothing
# here is a co-processor; esp_wifi talks to silicon on the same die.
#
# Station only. The dongle never becomes an AP: the phone reaches it over USB, and a softAP
# would be a second radio interface for the API guard to worry about and for nobody to use.
# Disabling SoftAP support is what makes that structural rather than just a promise wifi_sta.c
# happens to keep — esp_wifi_set_mode(WIFI_MODE_STA) alone doesn't remove the AP code, this does.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# The relays forward between two interfaces, so lwIP must be willing to hold more sockets than
# a single-purpose device needs. Worst-case budget, one line per consumer:
#
#   httpd (status_api.c, :8080): 1 listener + 1 ctrl_port + max_open_sockets(3, lowered from
#     esp_http_server's default of 7 in status_api.c, since this is an admin API, not proxied
#     REST traffic) = 5
#   relay_udp.c (:4210): 1 phone-facing socket + UDP_SESS_MAX(4) car-facing sockets = 5
#   relay_tcp.c (:80): 1 listener + RELAY_POOL_SIZE(4) slots x 2 sockets each
#     (phone_sock + car_sock, held whether a slot is SLOT_CONNECTING or SLOT_ACTIVE) = 9
#
# Worst case total: 5 + 5 + 9 = 19. 24 leaves 5 sockets of headroom above that — comfortable
# against a device with hundreds of KB of RAM to spare, and cheap to raise again if any of the
# three consumers above grows. (Before this fix the budget was computed wrong and this value
# was 16, seven short of the worst case — see task-5's review.)
CONFIG_LWIP_MAX_SOCKETS=24
